app/views/shared/_navbar.html.erb

SELECT COUNT(*) FROM "scale_requests" WHERE "scale_requests"."deleted_at" IS NULL AND "scale_requests"."patient_id" = 6 AND "scale_requests"."status" = 0
---
        <% if account.is_a?(Patient) %>
          <% pending_count = ScaleRequest.where(patient: account, status: "pending").count %>