app/views/devise/sessions/new.html.erb

      <% if resource.respond_to?(:email) && resource.email.present? %>
        <% user = User.find_by(email: resource.email) %>
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'pac1@hope.local' LIMIT 1