app/views/scale_requests/_form.html.erb

SELECT "patients".* FROM "patients" WHERE "patients"."deleted_at" IS NULL ORDER BY "patients"."full_name" ASC
---
    <h2><%= f.label :patient_id, t('scale_requests.form.patient') %></h2>
    <%= f.select :patient_id,
        options_from_collection_for_select(@patients, :id, :full_name, @scale_request.patient_id),
        { include_blank: "Digite para buscar um paciente..." },
        {