app/views/scale_requests/_scale_requests_table.html.erb

                <div class="avatar-sm bg-primary text-white rounded-circle d-flex align-items-center justify-content-center me-2">
                  <%= req.patient.full_name.first.upcase %>
---
SELECT "patients".* FROM "patients" WHERE "patients"."deleted_at" IS NULL AND "patients"."id" IN (1, 6)

                <% end %>
              <% if req.scale_response.present? %>
---
SELECT "scale_responses".* FROM "scale_responses" WHERE "scale_responses"."deleted_at" IS NULL AND "scale_responses"."scale_request_id" IN (3, 2, 1)

    <small class="text-muted">
      <%= t('scale_requests.table.showing_count', count: scale_requests.count) %>
---
SELECT COUNT(*) FROM "scale_requests" WHERE "scale_requests"."deleted_at" IS NULL