app/views/scale_requests/new.html.erb

<!-- Indicador de status SRS-2 para paciente selecionado -->
<% if @scale_request.patient.present? %>
---
SELECT "patients".* FROM "patients" WHERE "patients"."deleted_at" IS NULL AND "patients"."id" = 7 LIMIT 1