app/views/scale_requests/show.html.erb


    <% if @scale_request.scale_response.present? %>
---
SELECT "scale_responses".* FROM "scale_responses" WHERE "scale_responses"."deleted_at" IS NULL AND "scale_responses"."scale_request_id" = 2 LIMIT 1