app/controllers/dashboards_controller.rb

SELECT COUNT(*) AS "count_all", "scale_responses"."patient_id" AS "scale_responses_patient_id" FROM "scale_responses" WHERE "scale_responses"."deleted_at" IS NULL AND "scale_responses"."patient_id" IN (6, 5, 7, 8, 3, 1, 2, 4) GROUP BY "scale_responses"."patient_id"
SELECT COUNT(*) AS "count_all", "scale_requests"."patient_id" AS "scale_requests_patient_id" FROM "scale_requests" WHERE "scale_requests"."deleted_at" IS NULL AND "scale_requests"."patient_id" IN (6, 5, 7, 8, 3, 1, 2, 4) AND "scale_requests"."status" = 0 GROUP BY "scale_requests"."patient_id"
---
  def professionals
    authorize :dashboards, :professionals?
    @patients = policy_scope(Patient).order(:full_name)

    # Otimizar queries para evitar N+1
    # Buscar todas as contagens em queries únicas
    patient_ids = @patients.pluck(:id)

    completed_counts = ScaleResponse.where(patient_id: patient_ids)
                                   .group(:patient_id)
                                   .count

    pending_counts = ScaleRequest.where(patient_id: patient_ids, status: "pending")
                                 .group(:patient_id)
                                 .count

SELECT "scale_requests".* FROM "scale_requests" WHERE "scale_requests"."deleted_at" IS NULL AND "scale_requests"."patient_id" = 7 AND "scale_requests"."status" = 0 ORDER BY "scale_requests"."requested_at" DESC
SELECT "scale_responses".* FROM "scale_responses" WHERE "scale_responses"."deleted_at" IS NULL AND "scale_responses"."patient_id" = 7 ORDER BY "scale_responses"."completed_at" DESC
SELECT COUNT(*) FROM "scale_requests" WHERE "scale_requests"."deleted_at" IS NULL AND "scale_requests"."patient_id" = 6 AND "scale_requests"."status" = 0
SELECT COUNT(*) FROM "scale_responses" WHERE "scale_responses"."deleted_at" IS NULL AND "scale_responses"."patient_id" = 6
---
  def patients
    authorize :dashboards, :patients?
    @patient = current_user.account if current_user.account.is_a?(Patient)
    if @patient
      @pending_requests = ScaleRequest.where(patient: @patient, status: "pending")
                                      .includes(:psychometric_scale, :professional)
                                      .order(requested_at: :desc)
      @completed_responses = ScaleResponse.where(patient: @patient)
                                          .includes(:psychometric_scale)
                                          .order(completed_at: :desc)

      # Contadores para notificações
      @pending_count = @pending_requests.count
      @completed_count = @completed_responses.count