app/controllers/patients_controller.rb

    def set_patient
      @patient = Patient.find(params.expect(:id))
---
SELECT "patients".* FROM "patients" WHERE "patients"."deleted_at" IS NULL AND "patients"."id" = 1 LIMIT 1