app/controllers/patients_controller.rb

  def create
    @patient = Patient.new(patient_params)
    authorize @patient

    ActiveRecord::Base.transaction do
      if @patient.save
        # generated_password = SecureRandom.alphanumeric(6)
        generated_password = @patient.cpf.to_s.first(6)
        @patient.create_user!(
          email: @patient.email,
          password: generated_password,
          password_confirmation: generated_password,
          force_password_reset: false # MVP: will implement forced password reset later with true
        )
---
INSERT INTO "patients" ("full_name", "sex", "birthday", "started_at", "email", "cpf", "rg", "current_phone", "current_address", "deleted_at", "created_at", "updated_at") VALUES ('Bill Marston', NULL, '1921-01-01', NULL, 'bill@hope.local', '11111100000', '', NULL, NULL, NULL, '2025-08-13 17:21:24.559078', '2025-08-13 17:21:24.559078') RETURNING "id"
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "deleted_at", "force_password_reset", "created_at", "updated_at", "account_type", "account_id", "failed_attempts", "unlock_token", "locked_at") VALUES ('bill@hope.local', '$2a$12$CnFqtyRkIvoeMYUnhN3G9.re2Pz2RBRTr5cYTlPvOXflW.w3lEbzG', NULL, NULL, NULL, NULL, FALSE, '2025-08-13 17:21:24.879362', '2025-08-13 17:21:24.879362', 'Patient', 6, 0, NULL, NULL) RETURNING "id"

    def set_patient
      @patient = Patient.find(params.expect(:id))
---
SELECT "patients".* FROM "patients" WHERE "patients"."deleted_at" IS NULL AND "patients"."id" = 7 LIMIT 1