app/controllers/scale_requests_controller.rb

SELECT "scale_responses".* FROM "scale_responses" WHERE "scale_responses"."deleted_at" IS NULL AND "scale_responses"."scale_request_id" IN (3, 2, 1)
---
  def index
    @active_tab = :pending
    @scale_requests = policy_scope(ScaleRequest)
                        .pending
                        .includes(:patient, :professional, :psychometric_scale, :scale_response)
                        .recent

SELECT "scale_responses".* FROM "scale_responses" WHERE "scale_responses"."deleted_at" IS NULL AND "scale_responses"."scale_request_id" IN (5, 4)
---
  def pending
    @active_tab = :pending
    @scale_requests = policy_scope(ScaleRequest)
                        .pending
                        .includes(:patient, :professional, :psychometric_scale, :scale_response)
                        .recent

SELECT "scale_responses".* FROM "scale_responses" WHERE "scale_responses"."deleted_at" IS NULL AND "scale_responses"."scale_request_id" = 2
---
  def completed
    @active_tab = :completed
    @scale_requests = policy_scope(ScaleRequest)
                        .completed
                        .includes(:patient, :professional, :psychometric_scale, :scale_response)
                        .recent

SELECT "scale_responses".* FROM "scale_responses" WHERE "scale_responses"."deleted_at" IS NULL AND "scale_responses"."scale_request_id" IN (3, 1)
---
  def cancelled
    @active_tab = :cancelled
    @scale_requests = policy_scope(ScaleRequest)
                        .cancelled
                        .includes(:patient, :professional, :psychometric_scale, :scale_response)
                        .recent

SELECT "patients".* FROM "patients" WHERE "patients"."deleted_at" IS NULL AND "patients"."id" = 5 LIMIT 1
---
  def new
    @patient = Patient.find(params[:patient_id]) if params[:patient_id]

INSERT INTO "scale_requests" ("patient_id", "professional_id", "psychometric_scale_id", "status", "requested_at", "expires_at", "notes", "deleted_at", "created_at", "updated_at") VALUES (5, 6, 1, 0, '2025-09-08 21:02:54.617808', NULL, '', NULL, '2025-09-08 21:02:54.664189', '2025-09-08 21:02:54.664189') RETURNING "id"
SELECT COUNT(*) FROM "scale_requests" WHERE "scale_requests"."deleted_at" IS NULL
---
  def create
    @scale_request = ScaleRequest.new(scale_request_params)

    @scale_request.professional = current_user.account
    # status default já é :pending pelo enum; linha abaixo é redundante, mas inofensiva
    @scale_request.status ||= :pending
    authorize @scale_request

    # Verificação adicional antes de salvar
    if !ScaleRequest.can_create_for?(@scale_request.patient, @scale_request.psychometric_scale)
      Rails.logger.warn "[CONTROLLER] Tentativa de criar solicitação bloqueada - verificação adicional"
      @scale_request.errors.add(:base, "Não é possível criar esta solicitação. Verifique se o paciente já não possui uma solicitação ativa desta escala.")
      @psychometric_scales = PsychometricScale.active.ordered
      @patients = policy_scope(Patient).order(:full_name)
      flash.now[:alert] = I18n.t("errors.messages.not_saved", count: @scale_request.errors.count, resource: @scale_request.class.model_name.human.downcase)
      render :new, status: :unprocessable_entity
      return
    end

    if @scale_request.save
      redirect_to pending_scale_requests_path, notice: I18n.t("scale_requests.create.success")
    else
      # Log detalhado quando há erro de validação
      log_patient_scales_status(@scale_request.patient, @scale_request.psychometric_scale) if @scale_request.patient && @scale_request.psychometric_scale

      @psychometric_scales = PsychometricScale.active.ordered
      @patients = policy_scope(Patient).order(:full_name)
      flash.now[:alert] = I18n.t("errors.messages.not_saved", count: @scale_request.errors.count, resource: @scale_request.class.model_name.human.downcase)

SELECT "scale_requests".* FROM "scale_requests" WHERE "scale_requests"."deleted_at" IS NULL AND "scale_requests"."id" = 1 LIMIT 1
---
  def set_scale_request
    @scale_request = ScaleRequest.find(params[:id])