app/controllers/scale_responses_controller.rb

SELECT "scale_requests".* FROM "scale_requests" WHERE "scale_requests"."deleted_at" IS NULL AND "scale_requests"."id" = 4 LIMIT 1
SELECT "scale_responses".* FROM "scale_responses" WHERE "scale_responses"."deleted_at" IS NULL AND "scale_responses"."scale_request_id" = 1 LIMIT 1
SELECT "scale_requests".* FROM "scale_requests" WHERE "scale_requests"."deleted_at" IS NULL AND "scale_requests"."id" = 1 LIMIT 1
SELECT "patients".* FROM "patients" WHERE "patients"."deleted_at" IS NULL AND "patients"."id" = 8 LIMIT 1
SELECT "psychometric_scales".* FROM "psychometric_scales" WHERE "psychometric_scales"."deleted_at" IS NULL AND "psychometric_scales"."id" = 4 LIMIT 1
---
  def new
    @scale_request = ScaleRequest.find(params[:scale_request_id])
    authorize @scale_request, :respond?

    # Verificação adicional: se já existe resposta, redirecionar
    if @scale_request.scale_response.present?
      redirect_back_with_alert(I18n.t("scale_responses.errors.already_completed"))
      return
    end

    # Verificação adicional: se não está pendente, redirecionar
    unless @scale_request.pending?
      redirect_back_with_alert(I18n.t("scale_responses.errors.not_pending"))
      return
    end

    @scale_response = ScaleResponse.new
    @scale_response.scale_request = @scale_request
    @scale_response.patient = @scale_request.patient
    @scale_response.psychometric_scale = @scale_request.psychometric_scale

    @scale_items = @scale_request.psychometric_scale.scale_items.ordered

SELECT "scale_requests".* FROM "scale_requests" WHERE "scale_requests"."deleted_at" IS NULL AND "scale_requests"."id" = 4 LIMIT 1
SELECT "scale_responses".* FROM "scale_responses" WHERE "scale_responses"."deleted_at" IS NULL AND "scale_responses"."id" = 2 LIMIT 1
SELECT "patients".* FROM "patients" WHERE "patients"."deleted_at" IS NULL AND "patients"."id" = 8 LIMIT 1
SELECT "psychometric_scales".* FROM "psychometric_scales" WHERE "psychometric_scales"."deleted_at" IS NULL AND "psychometric_scales"."id" = 4 LIMIT 1
---
  def create
    @scale_request = ScaleRequest.find(params[:scale_request_id])
    authorize @scale_request, :respond?

    # Verificação adicional: se já existe resposta, redirecionar
    if @scale_request.scale_response.present?
      redirect_back_with_alert(I18n.t("scale_responses.errors.already_completed"))
      return
    end

    # Verificação adicional: se não está pendente, redirecionar
    unless @scale_request.pending?
      redirect_back_with_alert(I18n.t("scale_responses.errors.not_pending"))
      return
    end

    @scale_response = ScaleResponse.new(scale_response_params)
    @scale_response.scale_request = @scale_request
    @scale_response.patient = @scale_request.patient
    @scale_response.psychometric_scale = @scale_request.psychometric_scale

    authorize @scale_response

    if @scale_response.save
      @scale_request.complete!
      redirect_after_success
    else
      @scale_items = @scale_request.psychometric_scale.scale_items.ordered

SELECT "scale_responses".* FROM "scale_responses" WHERE "scale_responses"."deleted_at" IS NULL AND "scale_responses"."id" = 1 LIMIT 1
---
  def set_scale_response
    @scale_response = ScaleResponse.find(params[:id])