app/controllers/scale_requests_controller.rb

  def set_scale_request
    @scale_request = ScaleRequest.find(params[:id])
---
SELECT "scale_requests".* FROM "scale_requests" WHERE "scale_requests"."deleted_at" IS NULL AND "scale_requests"."id" = 1 LIMIT 1