app/controllers/scale_requests_controller.rb

  def new
    @patient = Patient.find(params[:patient_id]) if params[:patient_id]
---
SELECT "patients".* FROM "patients" WHERE "patients"."deleted_at" IS NULL AND "patients"."id" = 6 LIMIT 1

  def create
    @scale_request = ScaleRequest.new(scale_request_params)
    @scale_request.professional = current_user.account
    # status default já é :pending pelo enum; linha abaixo é redundante, mas inofensiva
    @scale_request.status ||= :pending
    authorize @scale_request

    if @scale_request.save
      redirect_to @scale_request.patient, notice: I18n.t("scale_requests.create.success")
---
INSERT INTO "scale_requests" ("patient_id", "professional_id", "psychometric_scale_id", "status", "requested_at", "expires_at", "notes", "deleted_at", "created_at", "updated_at") VALUES (6, 6, 1, 0, '2025-08-19 13:47:47.575407', NULL, 'Solicitação', NULL, '2025-08-19 13:47:47.591086', '2025-08-19 13:47:47.591086') RETURNING "id"
INSERT INTO "scale_requests" ("patient_id", "professional_id", "psychometric_scale_id", "status", "requested_at", "expires_at", "notes", "deleted_at", "created_at", "updated_at") VALUES (5, 6, 1, 0, '2025-08-19 15:10:03.969620', NULL, '', NULL, '2025-08-19 15:10:04.012089', '2025-08-19 15:10:04.012089') RETURNING "id"

  def set_scale_request
    @scale_request = ScaleRequest.find(params[:id])
---
SELECT "scale_requests".* FROM "scale_requests" WHERE "scale_requests"."deleted_at" IS NULL AND "scale_requests"."id" = 1 LIMIT 1