app/models/professional.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "account_type", "account_id") VALUES ('nick.bollettieri@hope.local', '$2a$12$RBFoDx4tekgU/I6bhx5Na.N4u3h79dTFKAWxhJH91InbZyukv0Isa', NULL, NULL, NULL, '2025-08-12 17:33:31.259195', '2025-08-12 17:33:31.259195', 'Professional', 1) RETURNING "id"
---
  def create_associated_user!
    return if user.present?

    generated_password = SecureRandom.base58(16)
    user_attributes = {
      email: email,
      password: generated_password,
      password_confirmation: generated_password
    }
    user_attributes[:force_password_reset] = true if User.column_names.include?("force_password_reset")

    build_user(user_attributes)
    user.save!