app/models/scale_response.rb

SELECT COUNT(*) FROM "psychometric_scale_items" WHERE "psychometric_scale_items"."psychometric_scale_id" = 1
---
  def total_items_count
    psychometric_scale.scale_items.count